[
  {
    "name": "Tanya Briggs",
    "message": "Asked Pete to come and quote for boiler installation after ours stopped working. He arrived for the appointment on time and ran through everything that would be needed for our new boiler, such as a smart controller. We had received quotes from other companies that had not even mentioned this requirement. He ran through all of our warranty options and explained the process of installation, commissioning and registration to us. When Pete came to do the work he was very tidy and friendly and explained what was happening as he went along. He was also very conscientious and patient with our rescue boy who likes to check people out who enter the house. Pete worked in a clean and tidy way and did not cause us any worries whilst doing the work. Once the work was complete, we had a small issue with the thermostat the next day and Pete came to resolve the issue within the hour of my phoning him. I am very pleased to have found Pete and given him the work and will be calling on him again, once the boilers' annual service is due next year. Highly recommend Pete, we found him to be an open, honest, respectful and friendly person."
  },
  {
    "name": "Maria Bishop",
    "message": "I rang Allgas for a quote to install a new outside tap. Pete responded instantly with a quote, and day and time for fitting. He was quick, efficient and professional. He also fixed a small leak under my kitchen sink that I'd just noticed the day before he was due to arrive. He gave me advice on my old Baxi boiler and a couple of other little problems I had with the heating system. He didn't charge me any more than the quoted price. He was very friendly and I will definitely use Allgas again and can highly reccomend."
  },
  {
    "name": "Holly Griffiths",
    "message": "Our boiler needed replacing. Pete was friendly and very helpful in explaining what would be involved in the new boiler installation. Installation was done to a high standard and all dirt and rubbish has been cleared away on completion. Highly recommend!!!"
  },
  {
    "name": "Sam I",
    "message": "I have used this plumber for many years. He has always been knowledgeable and tried to advise the best way to approach plumbing situations especially when I was renovating my home."
  },
  {
    "name": "Gillian Portsmouth",
    "message": "Our heating hadn't been working properly for some time and then last week the magna clean sprung a leak with water coming through the kitchen ceiling. I called Pete and he was here within a couple of hours and after another couple of hours had fixed the problem. Brilliant service, thank you so much"
  }
]
